aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_sci_iic_rx/src/targets/rx65n/r_sci_iic_rx65n.c
    #if SCI_IIC_CFG_CH3_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch3_rom =
{
    BSP_LOCK_SCI3,
    (sci_regs_t)&SCI3,
    &SYSTEM.MSTPCRB.LONG, BIT28_MASK,
    &ICU.IPR[IPR_SCI3_TXI3].BYTE,
    &ICU.IR[IR_SCI3_TXI3].BYTE,
    &ICU.GRPBL0.LONG, BIT6_MASK,
    &ICU.IER[IER_SCI3_TXI3].BYTE, BIT1_MASK,
    &ICU.GENBL0.LONG, BIT6_MASK,
    BSP_INT_SRC_BL0_SCI3_TEI3,
    sci_iic_int_sci_iic3_tei_isr,
    SCI_IIC_CFG_CH3_INT_PRIORITY,
    SCI_IIC_CFG_CH3_SSCL_GP,
    SCI_IIC_CFG_CH3_SSCL_PIN,
    SCI_IIC_MPC_SSCL3_ENABLE,
    SCI_IIC_CFG_CH3_SSDA_GP,
    SCI_IIC_CFG_CH3_SSDA_PIN,
    SCI_IIC_MPC_SSDA3_ENABLE,
    SCI_IIC_CFG_CH3_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH3_BITRATE_BPS,
    SCI_IIC_CFG_CH3_DIGITAL_FILTER,
    SCI_IIC_CFG_CH3_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch3_ctrl =
{
    &g_sci_iic_ch3_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH4_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch4_rom =
{
    BSP_LOCK_SCI4,
    (sci_regs_t)&SCI4,
    &SYSTEM.MSTPCRB.LONG, BIT27_MASK,
    &ICU.IPR[IPR_SCI4_TXI4].BYTE,
    &ICU.IR[IR_SCI4_TXI4].BYTE,
    &ICU.GRPBL0.LONG, BIT8_MASK,
    &ICU.IER[IER_SCI4_TXI4].BYTE, BIT3_MASK,
    &ICU.GENBL0.LONG, BIT8_MASK,
    BSP_INT_SRC_BL0_SCI4_TEI4,
    sci_iic_int_sci_iic4_tei_isr,
    SCI_IIC_CFG_CH4_INT_PRIORITY,
    SCI_IIC_CFG_CH4_SSCL_GP,
    SCI_IIC_CFG_CH4_SSCL_PIN,
    SCI_IIC_MPC_SSCL4_ENABLE,
    SCI_IIC_CFG_CH4_SSDA_GP,
    SCI_IIC_CFG_CH4_SSDA_PIN,
    SCI_IIC_MPC_SSDA4_ENABLE,
    SCI_IIC_CFG_CH4_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH4_BITRATE_BPS,
    SCI_IIC_CFG_CH4_DIGITAL_FILTER,
    SCI_IIC_CFG_CH4_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch4_ctrl =
{
    &g_sci_iic_ch4_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH5_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch5_rom =
{
    BSP_LOCK_SCI5,
    (sci_regs_t)&SCI5,
    &SYSTEM.MSTPCRB.LONG, BIT26_MASK,
    &ICU.IPR[IPR_SCI5_TXI5].BYTE,
    &ICU.IR[IR_SCI5_TXI5].BYTE,
    &ICU.GRPBL0.LONG, BIT10_MASK,
    &ICU.IER[IER_SCI5_TXI5].BYTE, BIT5_MASK,
    &ICU.GENBL0.LONG, BIT10_MASK,
    BSP_INT_SRC_BL0_SCI5_TEI5,
    sci_iic_int_sci_iic5_tei_isr,
    SCI_IIC_CFG_CH5_INT_PRIORITY,
    SCI_IIC_CFG_CH5_SSCL_GP,
    SCI_IIC_CFG_CH5_SSCL_PIN,
    SCI_IIC_MPC_SSCL5_ENABLE,
    SCI_IIC_CFG_CH5_SSDA_GP,
    SCI_IIC_CFG_CH5_SSDA_PIN,
    SCI_IIC_MPC_SSDA5_ENABLE,
    SCI_IIC_CFG_CH5_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH5_BITRATE_BPS,
    SCI_IIC_CFG_CH5_DIGITAL_FILTER,
    SCI_IIC_CFG_CH5_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch5_ctrl =
{
    &g_sci_iic_ch5_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH6_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch6_rom =
{
    BSP_LOCK_SCI6,
    (sci_regs_t)&SCI6,
    &SYSTEM.MSTPCRB.LONG, BIT25_MASK,
    &ICU.IPR[IPR_SCI6_TXI6].BYTE,
    &ICU.IR[IR_SCI6_TXI6].BYTE,
    &ICU.GRPBL0.LONG, BIT12_MASK,
    &ICU.IER[IER_SCI6_TXI6].BYTE, BIT7_MASK,
    &ICU.GENBL0.LONG, BIT12_MASK,
    BSP_INT_SRC_BL0_SCI6_TEI6,
    sci_iic_int_sci_iic6_tei_isr,
    SCI_IIC_CFG_CH6_INT_PRIORITY,
    SCI_IIC_CFG_CH6_SSCL_GP,
    SCI_IIC_CFG_CH6_SSCL_PIN,
    SCI_IIC_MPC_SSCL6_ENABLE,
    SCI_IIC_CFG_CH6_SSDA_GP,
    SCI_IIC_CFG_CH6_SSDA_PIN,
    SCI_IIC_MPC_SSDA6_ENABLE,
    SCI_IIC_CFG_CH6_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH6_BITRATE_BPS,
    SCI_IIC_CFG_CH6_DIGITAL_FILTER,
    SCI_IIC_CFG_CH6_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch6_ctrl =
{
    &g_sci_iic_ch6_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH7_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch7_rom =
{
    BSP_LOCK_SCI7,
    (sci_regs_t)&SCI7,
    &SYSTEM.MSTPCRB.LONG, BIT24_MASK,
    &ICU.IPR[IPR_SCI7_TXI7].BYTE,
    &ICU.IR[IR_SCI7_TXI7].BYTE,
    &ICU.GRPBL0.LONG, BIT14_MASK,
    &ICU.IER[IER_SCI7_TXI7].BYTE, BIT3_MASK,
    &ICU.GENBL0.LONG, BIT14_MASK,
    BSP_INT_SRC_BL0_SCI7_TEI7,
    sci_iic_int_sci_iic7_tei_isr,
    SCI_IIC_CFG_CH7_INT_PRIORITY,
    SCI_IIC_CFG_CH7_SSCL_GP,
    SCI_IIC_CFG_CH7_SSCL_PIN,
    SCI_IIC_MPC_SSCL7_ENABLE,
    SCI_IIC_CFG_CH7_SSDA_GP,
    SCI_IIC_CFG_CH7_SSDA_PIN,
    SCI_IIC_MPC_SSDA7_ENABLE,
    SCI_IIC_CFG_CH7_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH7_BITRATE_BPS,
    SCI_IIC_CFG_CH7_DIGITAL_FILTER,
    SCI_IIC_CFG_CH7_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch7_ctrl =
{
    &g_sci_iic_ch7_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH8_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch8_rom =
{
    BSP_LOCK_SCI8,
    (sci_regs_t)&SCI8,
    &SYSTEM.MSTPCRC.LONG, BIT27_MASK,
    &ICU.IPR[IPR_SCI8_TXI8].BYTE,
    &ICU.IR[IR_SCI8_TXI8].BYTE,
    &ICU.GRPBL1.LONG, BIT24_MASK,
    &ICU.IER[IER_SCI8_TXI8].BYTE, BIT5_MASK,
    &ICU.GENBL1.LONG, BIT24_MASK,
    BSP_INT_SRC_BL1_SCI8_TEI8,
    sci_iic_int_sci_iic8_tei_isr,
    SCI_IIC_CFG_CH8_INT_PRIORITY,
    SCI_IIC_CFG_CH8_SSCL_GP,
    SCI_IIC_CFG_CH8_SSCL_PIN,
    SCI_IIC_MPC_SSCL8_ENABLE,
    SCI_IIC_CFG_CH8_SSDA_GP,
    SCI_IIC_CFG_CH8_SSDA_PIN,
    SCI_IIC_MPC_SSDA8_ENABLE,
    SCI_IIC_CFG_CH8_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH8_BITRATE_BPS,
    SCI_IIC_CFG_CH8_DIGITAL_FILTER,
    SCI_IIC_CFG_CH8_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch8_ctrl =
{
    &g_sci_iic_ch8_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH9_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch9_rom =
{
    BSP_LOCK_SCI9,
    (sci_regs_t)&SCI9,
    &SYSTEM.MSTPCRC.LONG, BIT26_MASK,
    &ICU.IPR[IPR_SCI9_TXI9].BYTE,
    &ICU.IR[IR_SCI9_TXI9].BYTE,
    &ICU.GRPBL1.LONG, BIT26_MASK,
    &ICU.IER[IER_SCI9_TXI9].BYTE, BIT7_MASK,
    &ICU.GENBL1.LONG, BIT26_MASK,
    BSP_INT_SRC_BL1_SCI9_TEI9,
    sci_iic_int_sci_iic9_tei_isr,
    SCI_IIC_CFG_CH9_INT_PRIORITY,
    SCI_IIC_CFG_CH9_SSCL_GP,
    SCI_IIC_CFG_CH9_SSCL_PIN,
    SCI_IIC_MPC_SSCL9_ENABLE,
    SCI_IIC_CFG_CH9_SSDA_GP,
    SCI_IIC_CFG_CH9_SSDA_PIN,
    SCI_IIC_MPC_SSDA9_ENABLE,
    SCI_IIC_CFG_CH9_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH9_BITRATE_BPS,
    SCI_IIC_CFG_CH9_DIGITAL_FILTER,
    SCI_IIC_CFG_CH9_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch9_ctrl =
{
    &g_sci_iic_ch9_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH10_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch10_rom =
{
    BSP_LOCK_SCI10,
    (sci_regs_t)&SCI10,
    &SYSTEM.MSTPCRC.LONG, BIT25_MASK,
    &ICU.IPR[IPR_SCI10_TXI10].BYTE,
    &ICU.IR[IR_SCI10_TXI10].BYTE,
    &ICU.GRPAL0.LONG, BIT8_MASK,
    &ICU.IER[IER_SCI10_TXI10].BYTE, BIT1_MASK,
    &ICU.GENAL0.LONG, BIT8_MASK,
    BSP_INT_SRC_AL0_SCI10_TEI10,
    sci_iic_int_sci_iic10_tei_isr,
    SCI_IIC_CFG_CH10_INT_PRIORITY,
    SCI_IIC_CFG_CH10_SSCL_GP,
    SCI_IIC_CFG_CH10_SSCL_PIN,
    SCI_IIC_MPC_SSCL10_ENABLE,
    SCI_IIC_CFG_CH10_SSDA_GP,
    SCI_IIC_CFG_CH10_SSDA_PIN,
    SCI_IIC_MPC_SSDA10_ENABLE,
    SCI_IIC_CFG_CH10_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH10_BITRATE_BPS,
    SCI_IIC_CFG_CH10_DIGITAL_FILTER,
    SCI_IIC_CFG_CH10_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch10_ctrl =
{
    &g_sci_iic_ch10_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH11_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch11_rom =
{
    BSP_LOCK_SCI11,
    (sci_regs_t)&SCI11,
    &SYSTEM.MSTPCRC.LONG, BIT24_MASK,
    &ICU.IPR[IPR_SCI11_TXI11].BYTE,
    &ICU.IR[IR_SCI11_TXI11].BYTE,
    &ICU.GRPAL0.LONG, BIT12_MASK,
    &ICU.IER[IER_SCI11_TXI11].BYTE, BIT3_MASK,
    &ICU.GENAL0.LONG, BIT12_MASK,
    BSP_INT_SRC_AL0_SCI11_TEI11,
    sci_iic_int_sci_iic11_tei_isr,
    SCI_IIC_CFG_CH11_INT_PRIORITY,
    SCI_IIC_CFG_CH11_SSCL_GP,
    SCI_IIC_CFG_CH11_SSCL_PIN,
    SCI_IIC_MPC_SSCL11_ENABLE,
    SCI_IIC_CFG_CH11_SSDA_GP,
    SCI_IIC_CFG_CH11_SSDA_PIN,
    SCI_IIC_MPC_SSDA11_ENABLE,
    SCI_IIC_CFG_CH11_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH11_BITRATE_BPS,
    SCI_IIC_CFG_CH11_DIGITAL_FILTER,
    SCI_IIC_CFG_CH11_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch11_ctrl =
{
    &g_sci_iic_ch11_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

